In [30]:
people = {
    'first':['Corey', 'John', 'jane'],
    'last':['schafer', 'doe', 'doe'],
    'email':['coreyschafer@email.com', 'johndoe@email.com', 'janedoe@email.com']
}

In [31]:
import pandas as pd

In [32]:
df = pd.DataFrame(people)

In [33]:
df.head()

   first     last                   email
0  Corey  schafer  coreyschafer@email.com
1   John      doe       johndoe@email.com
2   jane      doe       janedoe@email.com

In [34]:
df['full_name'] = df['first'] + ' ' + df['last']

In [35]:
df

   first     last                   email      full_name
0  Corey  schafer  coreyschafer@email.com  Corey schafer
1   John      doe       johndoe@email.com       John doe
2   jane      doe       janedoe@email.com       jane doe

In [36]:
df.drop(columns = ['first', 'last'], inplace = True)

In [37]:
df

                    email      full_name
0  coreyschafer@email.com  Corey schafer
1       johndoe@email.com       John doe
2       janedoe@email.com       jane doe

In [38]:
df['full_name'].str.split(' ', expand = True)

       0        1
0  Corey  schafer
1   John      doe
2   jane      doe

In [39]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [42]:
df

                    email      full_name  first     last
0  coreyschafer@email.com  Corey schafer  Corey  schafer
1       johndoe@email.com       John doe   John      doe
2       janedoe@email.com       jane doe   jane      doe

In [43]:
df.append({'first':'Tony', 'last':'schafer', 'email':'tonyschafer@email.com'}, ignore_index = True)

/var/folders/80/c2dd9hw15tngjj29zd7lswl40000gn/T/ipykernel_1128/1921234921.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony', 'last':'schafer', 'email':'tonyschafer@email.com'}, ignore_index = True)

                    email      full_name  first     last
0  coreyschafer@email.com  Corey schafer  Corey  schafer
1       johndoe@email.com       John doe   John      doe
2       janedoe@email.com       jane doe   jane      doe
3   tonyschafer@email.com            NaN   Tony  schafer

In [57]:
people2 = {
    'first':['Rinita', 'Rumki'],
    'last':['shai', 'shai'],
    'email':['rinitashai@email.com', 'rumkishai@email.com']
}

In [58]:
df2= pd.DataFrame(people2)

In [59]:
df2

    first  last                 email
0  Rinita  shai  rinitashai@email.com
1   Rumki  shai   rumkishai@email.com

In [60]:
df2['full_name'] = df2['first'] + ' ' + df2['last']

In [61]:
df.append(df2, ignore_index = True, sort = False)

/var/folders/80/c2dd9hw15tngjj29zd7lswl40000gn/T/ipykernel_1128/747043576.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index = True, sort = False)

                    email      full_name   first     last
0  coreyschafer@email.com  Corey schafer   Corey  schafer
1       johndoe@email.com       John doe    John      doe
2       janedoe@email.com       jane doe    jane      doe
3    rinitashai@email.com    Rinita shai  Rinita     shai
4     rumkishai@email.com     Rumki shai   Rumki     shai

In [62]:
df

                    email      full_name  first     last
0  coreyschafer@email.com  Corey schafer  Corey  schafer
1       johndoe@email.com       John doe   John      doe
2       janedoe@email.com       jane doe   jane      doe

In [63]:
df = df.append(df2, ignore_index = True, sort = False)

/var/folders/80/c2dd9hw15tngjj29zd7lswl40000gn/T/ipykernel_1128/3517732396.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index = True, sort = False)

In [64]:
df

                    email      full_name   first     last
0  coreyschafer@email.com  Corey schafer   Corey  schafer
1       johndoe@email.com       John doe    John      doe
2       janedoe@email.com       jane doe    jane      doe
3    rinitashai@email.com    Rinita shai  Rinita     shai
4     rumkishai@email.com     Rumki shai   Rumki     shai

In [65]:
df.drop(index= 4)

                    email      full_name   first     last
0  coreyschafer@email.com  Corey schafer   Corey  schafer
1       johndoe@email.com       John doe    John      doe
2       janedoe@email.com       jane doe    jane      doe
3    rinitashai@email.com    Rinita shai  Rinita     shai

In [68]:
filt = df['last'] == 'shai'
df.drop(index = df[filt].index)

                    email      full_name  first     last
0  coreyschafer@email.com  Corey schafer  Corey  schafer
1       johndoe@email.com       John doe   John      doe
2       janedoe@email.com       jane doe   jane      doe